#используем образ Docker, основанный на Python 3.9
FROM python:3.9
#задание рабочей директории внутри котейнера
WORKDIR /app
#копируем файл из локальной директории внутрь контейнера в текущей рабочей
COPY requirements.txt .
#устанавливаем все необходимые зависимости с отключением кэширования пакетов 
RUN pip install --no-cache-dir -r requirements.txt
#копируем все файлы из локальной директории в текущую рабочую
COPY . .
#указание команды, которая выполняется при запуске контейнера (запускаем файл app.py с помощью интерпретатора Python)
CMD ["python", "app.py"]
